Update1C/ВыгрузкаФайловКонфигурации/InformationRegisters/ИсторияПотоков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ИсторияПотоков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Запущен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяМетода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Update1C/ВыгрузкаФайловКонфигурации/InformationRegisters/ИсторияПотоков/Ext/ManagerModule.bsl
Процедура ОчиститьЖурналПотоков() Экспорт
	
	НоваяЗапись = РегистрыСведений.ИсторияПотоков.СоздатьНаборЗаписей();
	НоваяЗапись.Записывать = Истина;
	НоваяЗапись.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьПоток(ИД, ИмяМетода) ЭКспорт
	
	Набор = РегистрыСведений.ИсторияПотоков.СоздатьНаборЗаписей();
	Набор.Отбор.Ид.Установить(ИД);
	Набор.Отбор.ИмяМетода.Установить(ИмяМетода);
	
	Набор.Прочитать();
	
	Если Набор.Количество() > 0 Тогда
		
		Возврат Набор[0];
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

 Функция ВыполнитьПоток(Поток) Экспорт
	
	Попытка
		
		Запись 				= РегистрыСведений.ИсторияПотоков.СоздатьМенеджерЗаписи();
		
		Запись.ДатаЗапуска  = ТекущаяДата();
		
		Запись.ИД 			= Поток.Ключ;
		Запись.ИмяМетода 	= Поток.ИмяМетода;
		Запись.Запущен 		= Истина;
		
		Запись.Записать();
		
		ФоновоеЗадание = ФоновыеЗадания.Выполнить(Поток.ИмяМетода, Поток.Параметры, Строка(Поток.Ключ), Поток.Наименование);
		
		Возврат ФоновоеЗадание;
		
	Исключение
		
		ОМ_Сервер.НоваяЗаписьЖурнала(0, "ИсторияПотоков.ВыполнитьПоток", ОписаниеОшибки());
		
	КонецПопытки;
		
КонецФункции
